print("r1 r2 i1 r3 i2 i3 i4")
n = []
for i in range(1):
    n += list(map(int, input().split()))
S1 = n[0] + n[2] + n[4] + n[6]
S2 = n[1] + n[2] + n[5] + n[6]
S3 = n[3] + n[4] + n[5] + n[6]
if S1 % 2 == 0 and S2 % 2 == 0 and S3 % 2 != 0:
    if n[3] == 1:
        n[3] = 0
    else:
        n[3] = 1
        print("Ошибка r3 (4 символ сообщения)")
        print("Правильное сообщение: " , n[:])
if S1 % 2 == 0 and S2 % 2 != 0 and S3 % 2 == 0:
    if n[1] == 1:
        n[1] = 0
    else:
        n[1] = 1
        print("Ошибка r2 (2 символ сообщения)")
        print("Правильное сообщение: ", n[:])
if S1 % 2 == 0 and S2 % 2 != 0 and S3 % 2 != 0:
    if n[5] == 1:
        n[5] = 0
    else:
        n[5] = 1
        print("Ошибка i3 (6 символ сообщения)")
        print("Правильное сообщение: ", n[:])
if S1 % 2 != 0 and S2 % 2 == 0 and S3 % 2 == 0:
    if n[0] == 1:
        n[0] = 0
    else:
        n[0] = 1
        print("Ошибка r1 (1 символ сообщения)")
        print("Правильное сообщение: ", n[:])
if S1 % 2 != 0 and S2 % 2 == 0 and S3 % 2 != 0:
    if n[4] == 1:
        n[4] = 0
    else:
        n[4] = 1
        print("Ошибка i2 (5 символ сообщения)")
        print("Правильное сообщение: ", n[:])
if S1 % 2 != 0 and S2 % 2 != 0 and S3 % 2 == 0:
    if n[2] == 1:
        n[2] = 0
    else:
        n[2] = 1
        print("Ошибка i1 (3 символ сообщения)")
        print("Правильное сообщение: ", n[:])
if S1 % 2 == 0 and S2 % 2 == 0 and S3 % 2 == 0:
    print("Нет ошибок")
    print("Сообщение остается неизменным: ", n[:])
if S1 % 2 != 0 and S2 % 2 != 0 and S3 % 2 != 0:
    if n[6] == 1:
        n[6] = 0
    else:
        n[6] = 1
        print("Ошибка i4 (7 символ сообщения)")
        print("Правильное сообщение: ", n[:])